# RoutingCondition Members (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
RoutingCondition Members
RoutingCondition Class Constructors Methods Properties See Also
---
The RoutingCondition type exposes the following members.
# Constructors
| Name | Description |
| --- | --- |
| --- | --- | --- |
| RoutingCondition | Creates a new RoutingCondition. |

# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose | Releases all resources used by the RoutingCondition |
| Equals | Determines whether the specified Object is equal to the current Object. (Inherited from Object.) |
| GetHashCode | Serves as a hash function for a particular type.  (Inherited from Object.) |
| GetType | Gets the Type of the current instance. (Inherited from Object.) |
| ToString | Returns a string that represents the current object. (Inherited from Object.) |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Diameter | The diameter of the segment or fitting specified for the routing condition. |
| IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

# See Also
RoutingCondition Class
Autodesk.Revit.DB Namespace